crud-codeigniter4/app/Views/alumnos/index.php

SELECT COUNT(*) AS `numrows`
FROM `detalle_alumno_curso`
WHERE `alumno_id` = '2'
---

                        <?php
                        $db = \Config\Database::connect();
                        $tieneCursos = $db->table('detalle_alumno_curso')
                            ->where('alumno_id', $alumno['alumno'])
                            ->countAllResults() > 0;