crud-codeigniter4/app/Controllers/AlumnoController.php

SELECT *
FROM `alumnos`
SELECT *
FROM `cursos`
---
    public function index()
    {
        $data['alumnos'] = $this->alumnoModel->findAll();
        $data['cursos']  = $this->cursoModel->findAll();

UPDATE `alumnos` SET `nombre` = 'Olga', `apellido` = 'Tejeda', `direccion` = 'Ciudad', `movil` = '784515151', `email` = 'olga@gmail.com', `user` = 'admin', `inactivo` = '1'
WHERE `alumnos`.`alumno` IN ('3')
INSERT INTO `alumnos` (`nombre`, `apellido`, `direccion`, `movil`, `email`, `inactivo`) VALUES ('Hector Manuel', 'Mendez Rodriguez', '9 calle 10-11 zona 1', '45695175', 'mhector@gmail.com', 0)
---
    public function store()
    {
        $this->alumnoModel->save([
            'nombre'   => $this->request->getPost('nombre'),
            'apellido' => $this->request->getPost('apellido'),
            'direccion'=> $this->request->getPost('direccion'),
            'movil'    => $this->request->getPost('movil'),
            'email'    => $this->request->getPost('email'),
            'inactivo' => 0,
        ]);

SELECT *
FROM `alumnos`
WHERE `alumnos`.`alumno` = '2'
---
    public function edit($id)
    {
        $data['alumno'] = $this->alumnoModel->find($id);

DELETE FROM `alumnos`
WHERE `alumno` IN ('3')
---
    public function delete($id)
    {
        $this->alumnoModel->delete($id);

DELETE FROM `detalle_alumno_curso`
WHERE `alumno_id` = '2'
INSERT INTO `detalle_alumno_curso` (`alumno_id`, `curso_id`, `fecha_inscripcion`) VALUES ('2', '1', '2025-08-30')
---
    public function asignarCursos()
    {
        $idAlumno = $this->request->getPost('alumno_id');
        $cursos   = $this->request->getPost('cursos') ?? [];

        $db = \Config\Database::connect();
        $builder = $db->table('detalle_alumno_curso');

        // Eliminar cursos previos del alumno
        $builder->where('alumno_id', $idAlumno)->delete();

        // Insertar nuevas asignaciones
        foreach ($cursos as $cursoId) {
            $builder->insert([
                'alumno_id'        => $idAlumno,
                'curso_id'         => $cursoId,
                'fecha_inscripcion'=> date('Y-m-d'),
            ]);