crud-codeigniter4/app/Controllers/CursoController.php

    public function index()
    {
        $data['cursos'] = $this->cursoModel->findAll();
---
SELECT *
FROM `cursos`